<!-- terraform-plan -->
Terraform plan:

```
module.projects.google_project.projects["lablos-development-app"]: Refreshing state... [id=projects/lablos-development-app]
module.folders.google_folder.folders["development"]: Refreshing state... [id=folders/935466500178]
module.network.google_compute_network.vpc_network["lablos-vpc-dev"]: Refreshing state... [id=projects/lablos-development-network/global/networks/lablos-vpc-dev]
module.projects.google_project.projects["lablos-development-network"]: Refreshing state... [id=projects/lablos-development-network]
module.folders.google_folder.folders["shared"]: Refreshing state... [id=folders/110628608422]
module.network.google_compute_network.vpc_network["lablos-vpc-dev-2"]: Refreshing state... [id=projects/lablos-development-network/global/networks/lablos-vpc-dev-2]
module.network.google_compute_global_address.private_ip_alloc["lablos-vpc-dev"]: Refreshing state... [id=projects/lablos-development-network/global/addresses/ip-psa-lablos-vpc-dev]
module.network.google_compute_global_address.private_ip_alloc["lablos-vpc-dev-2"]: Refreshing state... [id=projects/lablos-development-network/global/addresses/ip-psa-lablos-vpc-dev-2]
module.folders.google_folder.folders["network"]: Refreshing state... [id=folders/770744893968]
module.folders.google_folder.folders["secutiy"]: Refreshing state... [id=folders/693738025606]
module.network.google_compute_shared_vpc_host_project.host[0]: Refreshing state... [id=lablos-development-network]
module.organization_policies.google_org_policy_policy.policy["1"]: Refreshing state... [id=organizations/789146923162/policies/compute.disableSerialPortAccess]
module.organization_policies.google_org_policy_policy.policy["0"]: Refreshing state... [id=organizations/789146923162/policies/compute.skipDefaultNetworkCreation]
module.network.google_compute_firewall.default["fw1"]: Refreshing state... [id=projects/lablos-development-network/global/firewalls/allow-internal]
module.network.google_compute_firewall.default["fw2"]: Refreshing state... [id=projects/lablos-development-network/global/firewalls/allow-ssh]
module.network.google_compute_subnetwork.subnetwork["lablos-subnet-us-central1-dev"]: Refreshing state... [id=projects/lablos-development-network/regions/us-central1/subnetworks/lablos-subnet-us-central1-dev]
module.network.google_compute_subnetwork.subnetwork["lablos-subnet-us-east1-dev"]: Refreshing state... [id=projects/lablos-development-network/regions/us-east1/subnetworks/lablos-subnet-us-east1-dev]
module.projects.google_project_service.project["lablos-development-network:orgpolicy.googleapis.com"]: Refreshing state... [id=lablos-development-network/orgpolicy.googleapis.com]
module.projects.google_project_service.project["lablos-development-network:serviceusage.googleapis.com"]: Refreshing state... [id=lablos-development-network/serviceusage.googleapis.com]
module.projects.google_project_service.project["lablos-development-app:compute.googleapis.com"]: Refreshing state... [id=lablos-development-app/compute.googleapis.com]
module.projects.google_project_service.project["lablos-development-network:compute.googleapis.com"]: Refreshing state... [id=lablos-development-network/compute.googleapis.com]
module.network.google_service_networking_connection.foobar[0]: Refreshing state... [id=lablos-vpc-dev:servicenetworking.googleapis.com]
module.network.google_compute_shared_vpc_service_project.service1["lablos-development-app"]: Refreshing state... [id=lablos-development-network/lablos-development-app]
module.network.google_compute_network_peering_routes_config.peering_routes: Refreshing state... [id=projects/lablos-development-network/global/networks/lablos-vpc-dev/networkPeerings/servicenetworking-googleapis-com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.network.google_compute_network.vpc_network["lablos-vpc-dev-2"] will be created
  + resource "google_compute_network" "vpc_network" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_bgp_always_compare_med             = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "lablos-vpc-dev-2"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "lablos-development-network"
      + routing_mode                              = "GLOBAL"
      + self_link                                 = (known after apply)
    }

  # module.network.google_compute_subnetwork.subnetwork["lablos-subnet-us-central1-dev"] will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "172.30.0.0/25"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "lablos-subnet-us-central1-dev"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "lablos-development-network"
      + purpose                    = (known after apply)
      + region                     = "us-central1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```